---
kind: type
id: T:Autodesk.Revit.DB.BuiltInFailures.KeynoteFailures
source: html/d945b1a6-1698-0bdf-d3ca-2c6db1ead693.htm
---
# Autodesk.Revit.DB.BuiltInFailures.KeynoteFailures

## Syntax (C#)
```csharp
public static class KeynoteFailures
```